# Data Aggregation and Group Operations

Categorizing a dataset and applyting a function to each group, whether an aggregation or transformation, is often a critical component of a data analyzis workflow. After loading, merging and preparing a dataset, you may need to compute group statistics of possible _pivot tables_ for reporting or visualization purposes. pandas provides a flexible __groupby__ interface, enableing you to slice, dice, and summarize datasets in a natural way.

In [1]:
import numpy as np
import pandas as pd

## GroupBy Mechanism

In [2]:
df = pd.DataFrame({'key1': ['a','a','b','b','a'],
                  'key2': ['one','two','one','two','one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.693580  0.029847
1    a  two  0.613987  1.358307
2    b  one -0.362314  0.553049
3    b  two -1.714110  0.886619
4    a  one  0.553425  0.562866

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped # The grouped variable is now a GroupBy object

In [6]:
grouped.mean()

key1
a    0.620331
b   -1.038212
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [8]:
means

key1  key2
a     one     0.623503
      two     0.613987
b     one    -0.362314
      two    -1.714110
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a     0.623503  0.613987
b    -0.362314 -1.714110

In [10]:
states = np.array(['Ohio','Calofornia','California','Ohio','Ohio'])

In [11]:
years = np.array([2005,2005,2006,2005,2006])

In [12]:
df['data1'].groupby([states,years]).mean()

California  2006   -0.362314
Calofornia  2005    0.613987
Ohio        2005   -0.510265
            2006    0.553425
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.620331  0.650340
b    -1.038212  0.719834

In [14]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.623503  0.296357
     two   0.613987  1.358307
b    one  -0.362314  0.553049
     two  -1.714110  0.886619

In [15]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### Iterating Over Groups

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.693580  0.029847
1    a  two  0.613987  1.358307
4    a  one  0.553425  0.562866
b
  key1 key2     data1     data2
2    b  one -0.362314  0.553049
3    b  two -1.714110  0.886619

In [17]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.693580  0.029847
4    a  one  0.553425  0.562866
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.613987  1.358307
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.362314  0.553049
('b', 'two')
  key1 key2    data1     data2
3    b  two -1.71411  0.886619

In [18]:
pieces = dict(list(df.groupby('key1')))

In [19]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.362314  0.553049
3    b  two -1.714110  0.886619

In [20]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [21]:
grouped = df.groupby(df.dtypes,axis=1)

In [22]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.693580  0.029847
1  0.613987  1.358307
2 -0.362314  0.553049
3 -1.714110  0.886619
4  0.553425  0.562866
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Selecting a Column or Subset of Columns

In [23]:
df.groupby('key1')['data1']

In [24]:
df.groupby('key1')['data2']

In [25]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.296357
     two   1.358307
b    one   0.553049
     two   0.886619

In [26]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [27]:
s_grouped

In [28]:
s_grouped.mean()

key1  key2
a     one     0.296357
      two     1.358307
b     one     0.553049
      two     0.886619
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [29]:
people = pd.DataFrame(np.random.randn(5,5),
                    columns = ['a','b','c','d','e'],
                    index = ['Joe','Steve','Wes','Jim','Travis'])

In [30]:
people.iloc[2:3,[1,2]]=np.nan # Add a few NA values

In [31]:
people

               a         b         c         d         e
Joe    -1.531846  1.181676 -0.073743 -0.232617 -0.320251
Steve  -0.389106  0.028132 -0.795801 -0.384348  0.772950
Wes    -1.082295       NaN       NaN  1.250906 -0.861374
Jim    -0.529561 -0.283621 -0.582636  0.137835  0.620405
Travis  1.289959  0.263214  0.156397 -0.275299 -0.963061

In [32]:
mapping = {'a': 'red','b':'red','c':'blue',
          'd':'blue','e':'red','f':'orange'}

In [33]:
by_column = people.groupby(mapping,axis=1)

In [34]:
by_column.sum()

            blue       red
Joe    -0.306360 -0.670421
Steve  -1.180149  0.411975
Wes     1.250906 -1.943669
Jim    -0.444801 -0.192777
Travis -0.118901  0.590112

In [35]:
map_series = pd.Series(mapping)

In [36]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [37]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

### Grouping with Functions

In [38]:
people.groupby(len).sum()

          a         b         c         d         e
3 -3.143702  0.898055 -0.656379  1.156124 -0.561220
5 -0.389106  0.028132 -0.795801 -0.384348  0.772950
6  1.289959  0.263214  0.156397 -0.275299 -0.963061

In [39]:
key_list=['one','one','one','two','two']

In [40]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -1.531846  1.181676 -0.073743 -0.232617 -0.861374
  two -0.529561 -0.283621 -0.582636  0.137835  0.620405
5 one -0.389106  0.028132 -0.795801 -0.384348  0.772950
6 two  1.289959  0.263214  0.156397 -0.275299 -0.963061

### Grouping by Index Levels

In [41]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                    [1,3,5,1,3]],
                                   names = ['cty','tenor'])

In [42]:
hier_df = pd.DataFrame(np.random.randn(4,5),columns=columns)

In [43]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.104025  0.661502 -1.357622 -0.542045 -1.432728
1     -1.106563  0.317350 -0.899989 -0.300846  1.575453
2     -0.185759 -0.411267  1.008329 -0.235881  0.487098
3     -0.063781  1.396978  1.394356 -0.355480  0.656534

In [44]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## Data Aggregation

Aggregations refer to any data transformation that produces scalar values from arrays. The preceding examples have used several of them, including __mean()__, __count__, __min__, and __sum__.

In [45]:
df

  key1 key2     data1     data2
0    a  one  0.693580  0.029847
1    a  two  0.613987  1.358307
2    b  one -0.362314  0.553049
3    b  two -1.714110  0.886619
4    a  one  0.553425  0.562866

In [46]:
grouped = df.groupby('key1')

In [47]:
grouped['data1'].quantile(0.9)

key1
a    0.677661
b   -0.497494
Name: data1, dtype: float64

In [48]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [49]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.140155  1.328460
b     1.351795  0.333569

In [50]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.620331  0.070292  0.553425  0.583706  0.613987  0.653784
b      2.0 -1.038212  0.955864 -1.714110 -1.376161 -1.038212 -0.700263

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.693580   3.0  0.650340  0.668536  0.029847  0.296357  0.562866
b    -0.362314   2.0  0.719834  0.235869  0.553049  0.636442  0.719834


           75%       max
key1
a     0.960587  1.358307
b     0.803226  0.886619

### Column-Wise and Multiple Function Application

In [51]:
tips = pd.read_csv('../examples/tips.csv')

In [52]:
# Add tip percentage of total bill
tips['tip_pct'] = tips['tip']/tips['total_bill']

In [53]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [54]:
grouped = tips.groupby(['day','smoker'])

In [55]:
grouped_pct = grouped['tip_pct']

In [56]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [57]:
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [58]:
grouped_pct.agg([('foo','mean'),('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [59]:
functions = ['count','mean','max']

In [60]:
result = grouped['tip_pct','total_bill'].agg(functions)

In [61]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [62]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [63]:
ftuples = [('Durchschnitt','mean'), ('Abweichung', np.var)]

In [64]:
grouped['tip_pct','total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [65]:
grouped.agg({'tip':np.max, 'size': 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [66]:
grouped.agg({'tip_pct':['min','max','mean','std'],
            'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

### Returning Aggregated Data Without Row Indexes

In [67]:
tips.groupby(['day','smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

## Apply: General split-apply-combine

The most general-purpose GroupBy method is __apply__, which is the subject of the rest of this section.

In [68]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [69]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [70]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [71]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [72]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [73]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [74]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

### Suppressing the Group Keys

In [75]:
tips.groupby('smoker',group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

### Quantile and Bucket Analysis

In [76]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                     'data2': np.random.randn(1000)})

In [77]:
quartiles = pd.cut(frame.data1,4)

In [78]:
quartiles[:10]

0     (-0.152, 1.754]
1       (1.754, 3.66]
2     (-0.152, 1.754]
3     (-0.152, 1.754]
4    (-2.057, -0.152]
5     (-0.152, 1.754]
6    (-2.057, -0.152]
7    (-2.057, -0.152]
8     (-0.152, 1.754]
9    (-2.057, -0.152]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.971, -2.057] < (-2.057, -0.152] < (-0.152, 1.754] < (1.754, 3.66]]

In [79]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
           'count': group.count(), 'mean': group.mean()}

In [80]:
grouped = frame.data2.groupby(quartiles)

In [81]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.971, -2.057]   15.0  1.186952 -0.298426 -1.856788
(-2.057, -0.152]  423.0  2.807818 -0.034640 -2.599580
(-0.152, 1.754]   523.0  3.029133  0.026207 -2.690614
(1.754, 3.66]      39.0  1.608456  0.348229 -1.198686

In [82]:
# Return quantile numbers
grouping = pd.qcut(frame.data1,10,labels=False)

In [83]:
grouped = frame.data2.groupby(grouping)

In [84]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  1.930149 -0.067598 -2.599580
1      100.0  2.807818 -0.031057 -2.031665
2      100.0  2.256853  0.007055 -2.497146
3      100.0  2.592190 -0.075680 -2.574201
4      100.0  2.124923 -0.015416 -2.171958
5      100.0  3.029133  0.111812 -2.528720
6      100.0  2.229524 -0.144062 -2.369133
7      100.0  2.547893 -0.048706 -2.690614
8      100.0  2.958059  0.191119 -2.237728
9      100.0  1.787361  0.154117 -2.182451

### Example: Filling Missing Values with Group-Specific Values

In [85]:
s = pd.Series(np.random.randn(6))

In [86]:
s[::2]=np.nan

In [87]:
s

0         NaN
1   -0.467498
2         NaN
3   -0.143243
4         NaN
5    0.045065
dtype: float64

In [88]:
s.fillna(s.mean())

0   -0.188558
1   -0.467498
2   -0.188558
3   -0.143243
4   -0.188558
5    0.045065
dtype: float64

In [89]:
states = ['Ohio','New York','Vermont','Florida',
         'Oregon','Nevada','California','Idaho']

In [90]:
group_key = ['East']*4 + ['West']*4

In [91]:
data = pd.Series(np.random.randn(8), index=states)

In [92]:
data

Ohio         -0.546959
New York     -0.485256
Vermont      -1.291823
Florida       0.728023
Oregon       -0.295969
Nevada       -0.321684
California    0.941797
Idaho        -1.050489
dtype: float64

In [93]:
data[['Vermont','Nevada','Idaho']]=np.nan

In [94]:
data

Ohio         -0.546959
New York     -0.485256
Vermont            NaN
Florida       0.728023
Oregon       -0.295969
Nevada             NaN
California    0.941797
Idaho              NaN
dtype: float64

In [95]:
data.groupby(group_key).mean()

East   -0.101397
West    0.322914
dtype: float64

In [96]:
fill_mean = lambda g: g.fillna(g.mean())

In [97]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.546959
New York     -0.485256
Vermont      -0.101397
Florida       0.728023
Oregon       -0.295969
Nevada        0.322914
California    0.941797
Idaho         0.322914
dtype: float64

In [98]:
fill_values = {'East': 0.5, 'West': -1}

In [99]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [100]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.546959
New York     -0.485256
Vermont       0.500000
Florida       0.728023
Oregon       -0.295969
Nevada       -1.000000
California    0.941797
Idaho        -1.000000
dtype: float64

### Example: Random Sampling and Permutation

In [102]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H','S','C','D']
card_val = (list(range(1,11))+[10]*3)*4
base_names = ['A'] + list(range(2,11))+['J','K','Q']
cards=[]
for suit in ['H','S','C','D']:
    cards.extend(str(num) + suit for num in base_names)

In [103]:
deck = pd.Series(card_val, index=cards)

In [104]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [105]:
def draw(deck, n=5):
    return deck.sample(n)

In [106]:
draw(deck)

2H     2
QC    10
7C     7
3D     3
3S     3
dtype: int64

In [107]:
get_suit = lambda card: card[-1] # last letter in suit

In [108]:
deck.groupby(get_suit).apply(draw,n=2)

C  4C     4
   5C     5
D  2D     2
   5D     5
H  5H     5
   KH    10
S  KS    10
   8S     8
dtype: int64

In [109]:
deck.groupby(get_suit, group_keys=False).apply(draw,n=2)

2C      2
QC     10
QD     10
2D      2
8H      8
10H    10
AS      1
QS     10
dtype: int64

### Example: Group Weighted Average and Correlation

### Example: Group-Wise Linear Regression

## Pivot Tables and Cross-Tabulation

### Cross-Tabulation: Crossstab